package BinaryTree.BstTopoSize;

/**
 * 找到二叉树中符合搜索二叉树条件的最大拓扑结构
 *
 * 给定一棵二叉树的头节点head，已知所有节点的值都不一样，
 * 返回其中最大且符合搜索二叉树条件的最大拓扑结构的大小。
 *
 *            6
 *       /         \
 *      1           12
 *    /   \      /      \
 *   0     3    10      13
 *             /  \    /  \
 *            4    14 20  16
 *           / \   / \
 *          2   5 11 15
 *
 * 其中最大的且符合搜索二叉树条件的最大拓扑结构
 *            6
 *       /         \
 *      1           12
 *    /   \      /      \
 *   0     3    10      13
 *                        \
 *                        16
 *
 */
public class Solution {
}
