package BinaryTree.BiggestSubBST;

/**
 * 找到二叉树中的最大搜索二叉子树
 *
 * 给定一棵二叉树的头节点head，已知其中所有节点的值都不一样，找到含有节点最多的搜索二叉子树，
 * 并返回这棵子树的头节点。
 * 例如，
 *
 *            6
 *       /         \                                         10
 *      1           12          最大搜索二叉子树             /     \
 *    /   \      /      \       ==============>           4      14
 *   0     3    10      13                               / \    /  \
 *             /  \    /  \                             2   5  11  15
 *            4    14 20  16
 *           / \   / \
 *          2   5 11 15
 * 要求：
 * 如果节点数为N，要求时间复杂度为O(N)，额外空间复杂度为O(h)，h为二叉树的高度。
 */
public class Solution {

}
